#Область СлужебныеПроцедурыИФункции

// Запускает обмен данными с заданным интервалом.
//
Процедура ЗапуститьСинхронизацию() Экспорт

#Если МобильныйКлиент Тогда
	Если ОсновнойСерверДоступен() = Истина Тогда
		_ДемоОбменМобильныйКлиентАвтономныйКлиент.НачатьСинхронизацию();
	КонецЕсли;
#КонецЕсли

КонецПроцедуры

#Если МобильныйКлиент Тогда

// Проверяет завершение синхронизации основного и автономного серверов.
//
Процедура ОжидатьЗавершениеСинхронизации() Экспорт
	
	ТекстОшибки = "";
	ИдентификаторФоновогоЗадания = _ДемоОбменМобильныйКлиентКлиент.ИдентификаторФоновогоЗадания();
	Если Не _ДемоОбменМобильныйКлиентАвтономныйВызовСервера.ОбменДаннымиЗакончен(ИдентификаторФоновогоЗадания, ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ОжидатьЗавершениеСинхронизации");
	Если ТекстОшибки <> "" Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ОсновнойСерверДоступен() = Истина Тогда
		_ДемоОбменМобильныйКлиентКлиент.ОповеститьОЗавершении();
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли

#КонецОбласти