///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПодборФИО".
// ОбщийМодуль.ПодборФИОВызовСервера.
//
// Серверные процедуры работы с классификатором ФИО:
//  - возврат значений классификатора ФИО по переданным параметрам поиска.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// См. ПодборФИО.Подобрать.
//
Функция Подобрать(
		Знач РежимПоиска,
		Знач ДанныеФИО,
		Знач Пол,
		Знач РазмерВыборки) Экспорт
	
	Возврат ПодборФИО.Подобрать(
		РежимПоиска,
		ДанныеФИО,
		Пол,
		РазмерВыборки);
	
КонецФункции

// См. ПодборФИО.ОпределитьПол.
//
Функция ОпределитьПол(Знач ДанныеФИО) Экспорт
	
	Возврат ПодборФИО.ОпределитьПол(ДанныеФИО);
	
КонецФункции

// См. ПодборФИО.НайтиФИО.
//
Функция НайтиФИО(
		Знач ЧастиФИО,
		Знач ПолноеСовпадение = Истина) Экспорт
	
	Возврат ПодборФИО.НайтиФИО(
		ЧастиФИО,
		ПолноеСовпадение);
	
КонецФункции

#КонецОбласти
